index.org
#+TITLE: Flint - a simulator for biological and physiological models
#+OPTIONS: ^:nil num:nil html-postamble:nil
#+DESCRIPTION: Flint is a simulator for biological and physiological models written in CellML, PHML, and SBML.
#+KEYWORDS: numerical analysis, physiome, systems biology
#+HTML_LINK_HOME: https://flintproject.github.io/
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="flint.css"/>
* About
  Flint is a simulator for biological and physiological models written in [[https://www.cellml.org/][CellML]], [[http://physiodesigner.org/phml/index.html][PHML]], and/or [[http://sbml.org/][SBML]].
  - It can solve ordinary differential equations (ODE) numerically, and more.
  - It runs on Windows, macOS, Linux, etc.
  - It provides graphical user interface on top of command-line interface.
  - It is open source under the MIT license.
* Download
You can read [[https://raw.githubusercontent.com/flintproject/Flint/Flint-2.3.0/NEWS.org][NEWS]] about Flint 2.3 released at 2020-03-18.
** binary distribution
*** Windows installer for Windows 7 or later
- 64-bit version: [[https://downloads.sourceforge.net/project/flintproject/Flint/Flint-2.3.0-windows.x86_64.msi][Flint-2.3.0-windows.x86_64.msi]] (sha1sum: ad4941b5831bbb646688488f90da3fb0a3670c62)
*** Mac installer package for OS X Yosemite (10.10) or later:
- [[https://downloads.sourceforge.net/project/flintproject/Flint/Flint-2.3.0-mac.dmg][Flint-2.3.0-mac.dmg]] (sha1sum: 0fa0370e58c6fa91b251cff1b6a03aa0eb5b9d4d)
- *note* that you may have to change [[https://support.apple.com/en-us/HT202491][Gatekeeper options]] if you see an error message like
  "=... is damaged and can't be opened. You should move it to the Trash.="
  at opening the package. If you use macOS Sierra (10.12) or higher, follow [[https://apple.stackexchange.com/questions/243687/allow-applications-downloaded-from-anywhere-in-macos-sierra][the alternative instruction]] to bypass Gatekeeper.
*** RPM packages
- For RHEL/CentOS 8 (x86_64): [[https://downloads.sourceforge.net/project/flintproject/Flint/Flint-2.3.0-el8.x86_64.zip][Flint-2.3.0-el8.x86_64.zip]] (sha1sum: 5e73405e13e7e866b43d69761a84110f53d14958)
- For RHEL/CentOS 7 (x86_64): [[https://downloads.sourceforge.net/project/flintproject/Flint/Flint-2.3.0-el7.x86_64.zip][Flint-2.3.0-el7.x86_64.zip]] (sha1sum: 933bf59723879efbaa0f6eaeb6ab5ba89b3c469a)
** source distribution
- source tarball: [[https://github.com/flintproject/Flint/archive/Flint-2.3.0.tar.gz][Flint-2.3.0.tar.gz]]
* Documentation
  - [[https://flintproject.github.io/doc/flint-2.3.0-user-guide.pdf][Flint 2.3: The User Guide]]
  - [[https://www.youtube.com/user/PhysioDesigner][Tutorial videos on YouTube]]
  - [[http://www.physiodesigner.org/resources/specifications/specification_ISD.pdf][ISD format specification]]
* Development
  Flint's source repository is [[https://github.com/flintproject/Flint][in GitHub]]. Patches and/or suggestions are welcome.
* Publication
  To cite Flint in a scientific article:
  - Y. Asai et al., "Multilevel Modeling of Physiological Systems and Simulation Platform: PhysioDesigner, Flint and Flint K3 Service," 2012 IEEE/IPSJ 12th International Symposium on Applications and the Internet, Izmir, 2012, pp. 215-219.
    doi: [[https://doi.org/10.1109/SAINT.2012.40][10.1109/SAINT.2012.40]]
* Links
  - [[http://www.physiodesigner.org/][PhysioDesigner]] project
  - [[http://physiome.jp/][Physiome.jp]]
* Contact
  Send email to =tabe at fixedpoint dot jp= with any questions.
