index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-18 Wed 18:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Flint - a simulator for biological and physiological models</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Takeshi Abe" />
<meta name="description" content="Flint is a simulator for biological and physiological models written in CellML, PHML, and SBML."
 />
<meta name="keywords" content="numerical analysis, physiome, systems biology" />
<link rel="stylesheet" type="text/css" href="flint.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://flintproject.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">Flint - a simulator for biological and physiological models</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga14ce09">About</a></li>
<li><a href="#org8c1e623">Download</a>
<ul>
<li><a href="#orgb93406f">binary distribution</a>
<ul>
<li><a href="#org3ef57ee">Windows installer for Windows 7 or later</a></li>
<li><a href="#org4955192">Mac installer package for OS X Yosemite (10.10) or later:</a></li>
<li><a href="#org50e52b0">RPM packages</a></li>
</ul>
</li>
<li><a href="#org908a75b">source distribution</a></li>
</ul>
</li>
<li><a href="#orgdde86aa">Documentation</a></li>
<li><a href="#orgcfe7b65">Development</a></li>
<li><a href="#orga5d9fff">Publication</a></li>
<li><a href="#orgb8523b6">Links</a></li>
<li><a href="#org1c452f6">Contact</a></li>
</ul>
</div>
</div>
<div id="outline-container-orga14ce09" class="outline-2">
<h2 id="orga14ce09">About</h2>
<div class="outline-text-2" id="text-orga14ce09">
<p>
Flint is a simulator for biological and physiological models written in <a href="https://www.cellml.org/">CellML</a>, <a href="http://physiodesigner.org/phml/index.html">PHML</a>, and/or <a href="http://sbml.org/">SBML</a>.
</p>
<ul class="org-ul">
<li>It can solve ordinary differential equations (ODE) numerically, and more.</li>
<li>It runs on Windows, macOS, Linux, etc.</li>
<li>It provides graphical user interface on top of command-line interface.</li>
<li>It is open source under the MIT license.</li>
</ul>
</div>
</div>
<div id="outline-container-org8c1e623" class="outline-2">
<h2 id="org8c1e623">Download</h2>
<div class="outline-text-2" id="text-org8c1e623">
<p>
You can read <a href="https://raw.githubusercontent.com/flintproject/Flint/Flint-2.3.0/NEWS.org">NEWS</a> about Flint 2.3 released at 2020-03-18.
</p>
</div>
<div id="outline-container-orgb93406f" class="outline-3">
<h3 id="orgb93406f">binary distribution</h3>
<div class="outline-text-3" id="text-orgb93406f">
</div>
<div id="outline-container-org3ef57ee" class="outline-4">
<h4 id="org3ef57ee">Windows installer for Windows 7 or later</h4>
<div class="outline-text-4" id="text-org3ef57ee">
<ul class="org-ul">
<li>64-bit version: <a href="https://downloads.sourceforge.net/project/flintproject/Flint/Flint-2.3.0-windows.x86_64.msi">Flint-2.3.0-windows.x86_64.msi</a> (sha1sum: ad4941b5831bbb646688488f90da3fb0a3670c62)</li>
</ul>
</div>
</div>
<div id="outline-container-org4955192" class="outline-4">
<h4 id="org4955192">Mac installer package for OS X Yosemite (10.10) or later:</h4>
<div class="outline-text-4" id="text-org4955192">
<ul class="org-ul">
<li><a href="https://downloads.sourceforge.net/project/flintproject/Flint/Flint-2.3.0-mac.dmg">Flint-2.3.0-mac.dmg</a> (sha1sum: 0fa0370e58c6fa91b251cff1b6a03aa0eb5b9d4d)</li>
<li><b>note</b> that you may have to change <a href="https://support.apple.com/en-us/HT202491">Gatekeeper options</a> if you see an error message like
"<code>... is damaged and can't be opened. You should move it to the Trash.</code>"
at opening the package. If you use macOS Sierra (10.12) or higher, follow <a href="https://apple.stackexchange.com/questions/243687/allow-applications-downloaded-from-anywhere-in-macos-sierra">the alternative instruction</a> to bypass Gatekeeper.</li>
</ul>
</div>
</div>
<div id="outline-container-org50e52b0" class="outline-4">
<h4 id="org50e52b0">RPM packages</h4>
<div class="outline-text-4" id="text-org50e52b0">
<ul class="org-ul">
<li>For RHEL/CentOS 8 (x86_64): <a href="https://downloads.sourceforge.net/project/flintproject/Flint/Flint-2.3.0-el8.x86_64.zip">Flint-2.3.0-el8.x86_64.zip</a> (sha1sum: 5e73405e13e7e866b43d69761a84110f53d14958)</li>
<li>For RHEL/CentOS 7 (x86_64): <a href="https://downloads.sourceforge.net/project/flintproject/Flint/Flint-2.3.0-el7.x86_64.zip">Flint-2.3.0-el7.x86_64.zip</a> (sha1sum: 933bf59723879efbaa0f6eaeb6ab5ba89b3c469a)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org908a75b" class="outline-3">
<h3 id="org908a75b">source distribution</h3>
<div class="outline-text-3" id="text-org908a75b">
<ul class="org-ul">
<li>source tarball: <a href="https://github.com/flintproject/Flint/archive/Flint-2.3.0.tar.gz">Flint-2.3.0.tar.gz</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgdde86aa" class="outline-2">
<h2 id="orgdde86aa">Documentation</h2>
<div class="outline-text-2" id="text-orgdde86aa">
<ul class="org-ul">
<li><a href="https://flintproject.github.io/doc/flint-2.3.0-user-guide.pdf">Flint 2.3: The User Guide</a></li>
<li><a href="https://www.youtube.com/user/PhysioDesigner">Tutorial videos on YouTube</a></li>
<li><a href="http://www.physiodesigner.org/resources/specifications/specification_ISD.pdf">ISD format specification</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgcfe7b65" class="outline-2">
<h2 id="orgcfe7b65">Development</h2>
<div class="outline-text-2" id="text-orgcfe7b65">
<p>
Flint's source repository is <a href="https://github.com/flintproject/Flint">in GitHub</a>. Patches and/or suggestions are welcome.
</p>
</div>
</div>
<div id="outline-container-orga5d9fff" class="outline-2">
<h2 id="orga5d9fff">Publication</h2>
<div class="outline-text-2" id="text-orga5d9fff">
<p>
To cite Flint in a scientific article:
</p>
<ul class="org-ul">
<li>Y. Asai et al., "Multilevel Modeling of Physiological Systems and Simulation Platform: PhysioDesigner, Flint and Flint K3 Service," 2012 IEEE/IPSJ 12th International Symposium on Applications and the Internet, Izmir, 2012, pp. 215-219.
doi: <a href="https://doi.org/10.1109/SAINT.2012.40">10.1109/SAINT.2012.40</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgb8523b6" class="outline-2">
<h2 id="orgb8523b6">Links</h2>
<div class="outline-text-2" id="text-orgb8523b6">
<ul class="org-ul">
<li><a href="http://www.physiodesigner.org/">PhysioDesigner</a> project</li>
<li><a href="http://physiome.jp/">Physiome.jp</a></li>
</ul>
</div>
</div>
<div id="outline-container-org1c452f6" class="outline-2">
<h2 id="org1c452f6">Contact</h2>
<div class="outline-text-2" id="text-org1c452f6">
<p>
Send email to <code>tabe at fixedpoint dot jp</code> with any questions.
</p>
</div>
</div>
</div>
</body>
</html>